app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs"
---
  def index
    @blogs = Blog.all

INSERT INTO "blogs" ("title", "content", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?)  [["title", "My first blog"], ["content", "This exciting"], ["created_at", "2023-08-27 12:59:44.176056"], ["updated_at", "2023-08-27 12:59:44.176056"], ["author_id", 1]]
---
  def create
    blog = Blog.new(blog_params)
    if blog.save