app/controllers/feedbacks_controller.rb

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "feedbacks" ("content", "created_at", "updated_at", "blog_id") VALUES (?, ?, ?, ?)  [["content", "More more"], ["created_at", "2023-08-27 13:38:15.746786"], ["updated_at", "2023-08-27 13:38:15.746786"], ["blog_id", 1]]
---
  def create
    blog = Blog.find(feedback_params[:blog_id])
    author = Author.find(blog.id)
    feedback = Feedback.new(feedback_params)
    if feedback.save

SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."blog_id" = ? LIMIT ?  [["blog_id", 1], ["LIMIT", 1]]
---
  def show
    @blogs = Feedback.find_by(blog_id: params[:id])